vaca22/sdcard_file_server_esp32/main/file_server.c
    //httpd_resp_set_status(req, "303 See Other");
    //  httpd_resp_set_hdr(req, "Location", "/");

    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_send_chunk(req, NULL, 0);
    return ESP_OK;
}


static esp_err_t delete_post_handler(httpd_req_t *req) {
    char filepath[FILE_PATH_MAX];
    struct stat file_stat;


    const char *filename = get_path_from_uri(filepath, ((struct file_server_data *) req->user_ctx)->base_path,
                                             req->uri + sizeof("/delete") - 1, sizeof(filepath));
    if (!filename) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Filename too long");
        return ESP_FAIL;
    }

    if (filename[strlen(filename) - 1] == '/') {
        ESP_LOGE(TAG, "Invalid filename : %s", filename);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid filename");
        return ESP_FAIL;
    }

    if (stat(filepath, &file_stat) == -1) {
        ESP_LOGE(TAG, "File does not exist : %s", filename);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File does not exist x55");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Deleting file : %s", filename);

    unlink(filepath);


    httpd_resp_set_status(req, "303 See Other");
    httpd_resp_set_hdr(req, "Location", "/");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_sendstr(req, "File deleted successfully");
    return ESP_OK;
}

char lastSong[200];

static esp_err_t play_post_handler(httpd_req_t *req) {
    char filepath[FILE_PATH_MAX];
    struct stat file_stat;

    const char *filename = get_path_from_uri(filepath, ((struct file_server_data *) req->user_ctx)->base_path,
                                             req->uri + sizeof("/play") - 1, sizeof(filepath));
    if (!filename) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Filename too long");
        return ESP_FAIL;
    }

    if (filename[strlen(filename) - 1] == '/') {
        ESP_LOGE(TAG, "Invalid filename : %s", filename);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Invalid filename");
        return ESP_FAIL;
    }

    if (stat(filepath, &file_stat) == -1) {
        ESP_LOGE(TAG, "File does not exist x1: %s", filename);
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File does not exist x23");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Play file : %s", filename);


    audio_element_state_t el_state = audio_element_get_state(i2s_stream_writer);
    if (el_state == AEL_STATE_PAUSED) {
        if (strcmp(lastSong, filename) == 0) {
            audio_pipeline_resume(pipeline);
        } else {
            if (playFile != NULL) {
                fclose(playFile);
                playFile = NULL;
            }
            playFile = fopen(filepath, "rb");
            setvbuf(playFile, card_buf, _IOFBF, SD_Fragment);
            audio_pipeline_resume(pipeline);
        }

    } else {
        if (playFile != NULL) {
            fclose(playFile);
            playFile = NULL;
        }
        playFile = fopen(filepath, "rb");
        setvbuf(playFile, card_buf, _IOFBF, SD_Fragment);
        if (el_state == AEL_STATE_FINISHED) {
            audio_pipeline_reset_ringbuffer(pipeline);
            audio_pipeline_reset_elements(pipeline);
            audio_pipeline_change_state(pipeline, AEL_STATE_INIT);
            audio_pipeline_run(pipeline);
        } else if (el_state == AEL_STATE_INIT) {
            audio_pipeline_run(pipeline);
        }

    }

    ESP_LOGE("currentState", "%d", el_state);

    strcpy(lastSong, filename);

    httpd_resp_set_status(req, "303 See Other");
    httpd_resp_set_hdr(req, "Location", "/");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_sendstr(req, "File play successfully");
    return ESP_OK;
}


static esp_err_t pause_post_handler(httpd_req_t *req) {
    audio_element_state_t el_state = audio_element_get_state(i2s_stream_writer);
    if (el_state == AEL_STATE_RUNNING) {
        audio_pipeline_pause(pipeline);
    }

    httpd_resp_set_status(req, "303 See Other");
    httpd_resp_set_hdr(req, "Location", "/");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_sendstr(req, "File play successfully");
    return ESP_OK;
}


static esp_err_t volume_post_handler(httpd_req_t *req) {
    char filepath[FILE_PATH_MAX];
    struct stat file_stat;

    const char *filename = get_path_from_uri(filepath, ((struct file_server_data *) req->user_ctx)->base_path,
                                             req->uri + sizeof("/volume") - 1, sizeof(filepath));
    if (!filename) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Filename too long");
        return ESP_FAIL;
    }

    int duck = atoi(filename + 1);
    ESP_LOGE("asdf", "%d      %s", duck, filename);
    if (duck == 0) {
        CJC8988_SET_Volume(0);
    } else {
        ESP_LOGE("asdf", "%d", duck);
        CJC8988_SET_Volume(255 + duck - 100);
    }
    httpd_resp_set_status(req, "303 See Other");
    httpd_resp_set_hdr(req, "Location", "/");
    httpd_resp_set_hdr(req, "Connection", "close");
    httpd_resp_sendstr(req, "File play successfully");
    return ESP_OK;
}


int mp3_music_read_cb(audio_element_handle_t el, char *buf, int len, TickType_t wait_time, void *ctx) {

    if (haveSD == 0) {

        while (isSafe2(len) == 0) {
            if (haveSD == 1) {
                break;
            }
            vTaskDelay(1);
        }
        if (haveSD == 0) {
            for (int k = 0; k < len; k++) {
                if (playIndex >= total) {
                    playIndex = 0;
                }
                buf[k] = play_ring_buffer[playIndex];
                playIndex++;
            }

            return len;
        }
    }

    while (playFile == NULL) {
        vTaskDelay(1);
    }

    int a = fread(buf, len, 1, playFile);
    if (a == 0) {
        fclose(playFile);
        playFile = NULL;
        audio_pipeline_pause(pipeline);
    }
    return len;
}

static void chem1_task(void *pvParameters) {
    const char *base_path = "/sdcard";
    static struct file_server_data *server_data = NULL;


    if (server_data) {
        ESP_LOGE(TAG, "File server already started");
    }

