vaca22/sdcard_file_server_esp32/main/file_server.c
    server_data = calloc(1, sizeof(struct file_server_data));
    if (!server_data) {
        ESP_LOGE(TAG, "Failed to allocate memory for server data");
    }
    strlcpy(server_data->base_path, base_path,
            sizeof(server_data->base_path));

    httpd_handle_t server = NULL;
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    config.uri_match_fn = httpd_uri_match_wildcard;

    ESP_LOGI(TAG, "Starting HTTP Server on port: '%d'", config.server_port);
    if (httpd_start(&server, &config) != ESP_OK) {
        ESP_LOGE(TAG, "Failed to start file server!");
    }


    httpd_uri_t file_download = {
            .uri       = "/*",
            .method    = HTTP_GET,
            .handler   = download_get_handler,
            .user_ctx  = server_data
    };


    httpd_register_uri_handler(server, &file_download);


    httpd_uri_t ble_download = {
            .uri       = "/ble*",
            .method    = HTTP_POST,
            .handler   = ble_get_handler,
            .user_ctx  = server_data
    };
    httpd_register_uri_handler(server, &ble_download);

    httpd_uri_t file_upload = {
            .uri       = "/upload/*",
            .method    = HTTP_POST,
            .handler   = upload_post_handler,
            .user_ctx  = server_data
    };
    httpd_register_uri_handler(server, &file_upload);


    httpd_uri_t file_uploadPlay = {
            .uri       = "/uploadPlay/*",
            .method    = HTTP_POST,
            .handler   = uploadPlay_post_handler,
            .user_ctx  = server_data
    };
    httpd_register_uri_handler(server, &file_uploadPlay);


    httpd_uri_t file_delete = {
            .uri       = "/delete/*",
            .method    = HTTP_POST,
            .handler   = delete_post_handler,
            .user_ctx  = server_data
    };
    httpd_register_uri_handler(server, &file_delete);
    httpd_uri_t file_play = {
            .uri       = "/play/*",
            .method    = HTTP_POST,
            .handler   = play_post_handler,
            .user_ctx  = server_data
    };
    httpd_register_uri_handler(server, &file_play);
    httpd_uri_t file_pause = {
            .uri       = "/pause/*",
            .method    = HTTP_POST,
            .handler   = pause_post_handler,
            .user_ctx  = server_data
    };
    httpd_register_uri_handler(server, &file_pause);

    httpd_uri_t file_volume = {
            .uri       = "/volume/*",
            .method    = HTTP_POST,
            .handler   = volume_post_handler,
            .user_ctx  = server_data
    };
    httpd_register_uri_handler(server, &file_volume);
    while (1) {

        vTaskDelay(1000);
    }
}

int UDP_PORT = 8889;


char *vaca = "vaca";
char *vacax = "xvacax";
int udpsock=NULL;

static void udp_server_task(void *pvParameters) {
    char rx_buffer[128];
    char addr_str[128];
    int addr_family = (int) pvParameters;
    int ip_protocol = 0;
    struct sockaddr_in6 dest_addr;

    while (1) {

        if (addr_family == AF_INET) {
            struct sockaddr_in *dest_addr_ip4 = (struct sockaddr_in *) &dest_addr;
            dest_addr_ip4->sin_addr.s_addr = htonl(INADDR_ANY);
            dest_addr_ip4->sin_family = AF_INET;
            dest_addr_ip4->sin_port = htons(UDP_PORT);
            ip_protocol = IPPROTO_IP;
        } else if (addr_family == AF_INET6) {
            bzero(&dest_addr.sin6_addr.un, sizeof(dest_addr.sin6_addr.un));
            dest_addr.sin6_family = AF_INET6;
            dest_addr.sin6_port = htons(UDP_PORT);
            ip_protocol = IPPROTO_IPV6;
        }

        udpsock = socket(addr_family, SOCK_DGRAM, ip_protocol);
        if (udpsock < 0) {
            ESP_LOGE(TAG, "Unable to create socket: errno %d", errno);
            break;
        }
        ESP_LOGI(TAG, "Socket created");


        int err = bind(udpsock, (struct sockaddr *) &dest_addr, sizeof(dest_addr));
        if (err < 0) {
            ESP_LOGE(TAG, "Socket unable to bind: errno %d", errno);
        }
        ESP_LOGI(TAG, "Socket bound, port %d", UDP_PORT);

        while (1) {

            ESP_LOGI(TAG, "Waiting for data");
            struct sockaddr_storage source_addr; // Large enough for both IPv4 or IPv6
            socklen_t socklen = sizeof(source_addr);
            int len = recvfrom(udpsock, rx_buffer, sizeof(rx_buffer) - 1, 0, (struct sockaddr *) &source_addr, &socklen);

            // Error occurred during receiving
            if (len < 0) {
                ESP_LOGE(TAG, "recvfrom failed: errno %d", errno);
                break;
            }
                // Data received
            else {
                // Get the sender's ip address as string
                if (source_addr.ss_family == PF_INET) {
                    inet_ntoa_r(((struct sockaddr_in *) &source_addr)->sin_addr, addr_str, sizeof(addr_str) - 1);
                } else if (source_addr.ss_family == PF_INET6) {
                    inet6_ntoa_r(((struct sockaddr_in6 *) &source_addr)->sin6_addr, addr_str, sizeof(addr_str) - 1);
                }

                rx_buffer[len] = 0; // Null-terminate whatever we received and treat like a string...
                ESP_LOGI(TAG, "Received %d bytes from %s:", len, addr_str);
                ESP_LOGI(TAG, "%s", rx_buffer);
                int valid = 1;
                for (int k = 0; k < 4; k++) {
                    if (rx_buffer[k] != vaca[k]) {
                        valid = 0;
                        break;
                    }
                }
                if (valid) {
                    int duck = rx_buffer[4];
                    if (duck == 0) {
                        CJC8988_SET_Volume(0);
                    } else {
                        ESP_LOGE("asdf", "%d", duck);
                        CJC8988_SET_Volume(255 + duck - 100);
                    }

                    int err = sendto(udpsock, vacax, 6, 0, (struct sockaddr *) &source_addr, sizeof(source_addr));
                    if (err < 0) {
                        ESP_LOGE(TAG, "Error occurred during sending: errno %d", errno);
                        break;
                    }
                }

