vaca22/sdcard_file_server_esp32/main/file_server.c
            }
        }

        if (udpsock != -1) {
            ESP_LOGE(TAG, "Shutting down socket and restarting...");
            shutdown(udpsock, 0);
            close(udpsock);
        }
    }
    vTaskDelete(NULL);
}

esp_err_t start_file_server() {
    xTaskCreate(udp_server_task, "udp_server", 4096, (void *) AF_INET, 5, NULL);
    if (haveSD == 0) {
        play_ring_buffer = malloc(total);
    }
    esp_log_level_set("*", ESP_LOG_WARN);
    esp_log_level_set(TAG, ESP_LOG_INFO);

    audio_board_handle_t board_handle = audio_board_init();
    audio_hal_ctrl_codec(board_handle->audio_hal, AUDIO_HAL_CODEC_MODE_BOTH, AUDIO_HAL_CTRL_START);
    audio_pipeline_cfg_t pipeline_cfg = DEFAULT_AUDIO_PIPELINE_CONFIG();
    pipeline = audio_pipeline_init(&pipeline_cfg);

    mp3_decoder_cfg_t mp3_cfg = DEFAULT_MP3_DECODER_CONFIG();
    mp3_cfg.out_rb_size = 16 * 1024;
    mp3_decoder = mp3_decoder_init(&mp3_cfg);
    audio_element_set_read_cb(mp3_decoder, mp3_music_read_cb, NULL);

    i2s_stream_cfg_t i2s_cfg = I2S_STREAM_CFG_DEFAULT();
    i2s_cfg.type = AUDIO_STREAM_WRITER;
    i2s_cfg.i2s_config.use_apll = false;
    i2s_cfg.i2s_config.sample_rate = 44100;
    i2s_stream_writer = i2s_stream_init(&i2s_cfg);


    audio_pipeline_register(pipeline, mp3_decoder, "mp3");
    audio_pipeline_register(pipeline, i2s_stream_writer, "i2s");

    const char *link_tag[2] = {"mp3", "i2s"};
    audio_pipeline_link(pipeline, &link_tag[0], 2);

    audio_event_iface_cfg_t evt_cfg = AUDIO_EVENT_IFACE_DEFAULT_CFG();
    audio_event_iface_handle_t evt = audio_event_iface_init(&evt_cfg);

    ESP_LOGI(TAG, "[4.1] Listening event from all elements of pipeline");
    audio_pipeline_set_listener(pipeline, evt);


    int x = xPortGetCoreID();
    ESP_LOGI(TAG, "Corefuckxy  %d", x);
    //ESP_ERROR_CHECK(i2c_master_init());
    ESP_LOGI(TAG, "I2C initialized successfully");
    vTaskDelay(10);
    CJC8988_DAC_TO_LOUT1();

    CJC8988_SET_Volume(220);
    vTaskDelay(100);

    xTaskCreatePinnedToCore(chem1_task, "chem1", 4096, NULL, configMAX_PRIORITIES, &chem1_task_h, 1);
    return ESP_OK;
}
